Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ИДЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Период) И (Объект.Период.ДатаНачала <> НачалоМесяца(Объект.Период.ДатаНачала)
		Или Объект.Период.ДатаОкончания <> КонецМесяца(Объект.Период.ДатаОкончания)) Тогда 
		
		Объект.Период.ДатаНачала = НачалоМесяца(Объект.Период.ДатаНачала);
		Объект.Период.ДатаОкончания = КонецМесяца(Объект.Период.ДатаОкончания);
		
		ТекстСообщения = СтрШаблон("Период изменен с %1 по %2",Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.Период");		
		
	КонецЕсли;
	
	Объект.ДоговорИРеализация.Очистить(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	Объект.Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен период!");
		Возврат;
		
	КонецЕсли; 
	
	// Обработка формирует документы только за 1 полный месяц
	Если КонецМесяца(Объект.Период.ДатаНачала) <> КонецМесяца(Объект.Период.ДатаОкончания) Тогда 
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период должен составлять полный месяц!");
		Возврат;
		
	КонецЕсли;   
	
	ТяжелаяОперация = ВыполнитьТяжелуюОперациюНаСервере(); 
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Вставить("ВыводитьСообщения", Истина);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);  
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ТяжелаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	
КонецПроцедуры
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ВыполнитьТяжелуюОперациюНаСервере()
	
	ТяжелаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "ВКМ_ДлительныеОперации.СозданиеРеализаций", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
	Возврат ТяжелаяОперация ;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отменено!");
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли; 
	
	РезультатОбработки  = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	Объект.ДоговорИРеализация.Очистить(); 
	
	Если РезультатОбработки.СозданоДокументов = 0 и РезультатОбработки.НеСозданоДокументов = 0 Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("В выбранный период все документы уже созданы!");
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗаписатьДанныеДокументов(РезультатОбработки);
		
		ТекстСообщения = СтрШаблон(СтрШаблон("Для данного периода количество созданных документов обработкой - %1.
		|Количество документов, которые были созданы специалистом ранее - %2.",
		РезультатОбработки.СозданоДокументов, РезультатОбработки.УжеСуществовало));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаписатьДанныеДокументов(РезультатОбработки)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТЗ.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Для Каждого Элемент Из РезультатОбработки.МассивДоговоровИРеализаций Цикл
		Стр = ТЗ.Добавить();
		Стр.Договор = Элемент.Договор;
		Стр.Документ = Элемент.Документ;
	КонецЦикла;
	
	// Пробуем путь без "Объект."
	Попытка
		ЗначениеВРеквизитФормы(ТЗ, "ДоговорИРеализация");
		Возврат;
	Исключение
	КонецПопытки;
	
	// Пробуем путь с "Объект."
	Попытка
		ЗначениеВРеквизитФормы(ТЗ, "Объект.ДоговорИРеализация");
		Возврат;
	Исключение
	КонецПопытки;
	
	// Если оба не сработали — заполняем напрямую
	Объект.ДоговорИРеализация.Очистить();
	Для Каждого Элемент Из РезультатОбработки.МассивДоговоровИРеализаций Цикл
		Строка = Объект.ДоговорИРеализация.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Элемент);
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти
